# MepSpotTopElevationIncludeInsulation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSpotTopElevationIncludeInsulation Property
ParameterTypeId Class See Also
---
"Spot Top of Insulation Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSpotTopElevationIncludeInsulation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSpotTopElevationIncludeInsulation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSpotTopElevationIncludeInsulation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace